

const express = require('express')
const app = express()

app.use((request,response,next)=>{
	// console.log('有人请求服务器3了');
	console.log('请求来自于',request.get('Host'));
	console.log('请求的地址',request.url);
	next()
})

app.get('/api/students',(request,response)=>{
	const a ={
        "status": 0,
        "message": "ok",
        "result_type": "poi_type",
        "results": [
            {
                "name": "归元禅寺",
                "location": {
                    "lat": 30.551579,
                    "lng": 114.265693
                },
                "address": "武汉市汉阳区归元寺路20号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "汉阳区",
                "street_id": "4f0c2b134fbce097c3364440",
                "telephone": "(027)84844756,18963994585",
                "detail": 1,
                "uid": "4f0c2b134fbce097c3364440"
            },
            {
                "name": "武汉极地海洋公园",
                "location": {
                    "lat": 30.67007,
                    "lng": 114.285069
                },
                "address": "武汉市东西湖区金银潭大道96号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "东西湖区",
                "street_id": "78bd50f7f9cf802531870a16",
                "telephone": "(027)85699999",
                "detail": 1,
                "uid": "78bd50f7f9cf802531870a16"
            },
            {
                "name": "吹笛景区",
                "location": {
                    "lat": 30.525509,
                    "lng": 114.453804
                },
                "address": "武汉市洪山区珞瑜东路619号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "洪山区",
                "street_id": "",
                "telephone": "(027)87804351",
                "detail": 1,
                "uid": "52e446ff6891e71ff32d835a"
            },
            {
                "name": "武汉博物馆",
                "location": {
                    "lat": 30.617735,
                    "lng": 114.263081
                },
                "address": "湖北省武汉市江汉区青年路373号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "江汉区",
                "street_id": "c5ddcc086b181cc5d813182a",
                "telephone": "(027)85625587",
                "detail": 1,
                "uid": "c5ddcc086b181cc5d813182a"
            },
            {
                "name": "武汉花博汇",
                "location": {
                    "lat": 30.495167,
                    "lng": 114.080648
                },
                "address": "湖北省武汉市蔡甸区天星村1号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "蔡甸区",
                "street_id": "",
                "telephone": "(027)69168881",
                "detail": 1,
                "uid": "22e9fa583558af036d20b96f"
            },
            {
                "name": "紫薇都市田园",
                "location": {
                    "lat": 30.820795,
                    "lng": 114.618851
                },
                "address": "武汉市新洲区仓埠街丰乐寺村特1号(09省道)",
                "province": "湖北省",
                "city": "武汉市",
                "area": "新洲区",
                "street_id": "",
                "telephone": "17764048093",
                "detail": 1,
                "uid": "5b77d91c4484543a00ec01ed"
            },
            {
                "name": "中山舰旅游区",
                "location": {
                    "lat": 30.352003,
                    "lng": 114.141574
                },
                "address": "金口街中山舰路特1号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "江夏区",
                "street_id": "6c277036fe59f95938221c30",
                "telephone": "(027)81566226",
                "detail": 1,
                "uid": "6c277036fe59f95938221c30"
            },
            {
                "name": "武汉欢乐谷",
                "location": {
                    "lat": 30.59723,
                    "lng": 114.399429
                },
                "address": "湖北省武汉市洪山区欢乐大道196号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "洪山区",
                "street_id": "4f161ac9b705745ea8f72916",
                "detail": 1,
                "uid": "4f161ac9b705745ea8f72916"
            },
            {
                "name": "中国地质大学-逸夫博物馆",
                "location": {
                    "lat": 30.523685,
                    "lng": 114.40699
                },
                "address": "湖北省武汉市洪山区鲁磨路388号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "洪山区",
                "street_id": "df1c5812cef216707369d353",
                "telephone": "(027)67848584",
                "detail": 1,
                "uid": "df1c5812cef216707369d353"
            },
            {
                "name": "首义公园",
                "location": {
                    "lat": 30.547674,
                    "lng": 114.320165
                },
                "address": "湖北省武汉市武昌区武珞路47号",
                "province": "湖北省",
                "city": "武汉市",
                "area": "武昌区",
                "street_id": "b703e96ba00a95fa8e1a89ba",
                "detail": 1,
                "uid": "b703e96ba00a95fa8e1a89ba"
            },
            {
                "name": "沂蒙云瀑洞天",
                "location": {
                  "lat": 35.419758,
                  "lng": 118.0531
                },
                "address": "临沂市费县山城公路",
                "city": "临沂市",
                "telephone": "(0539)5837788"
              },
              {
                "name": "龙园旅游区",
                "location": {
                  "lat": 35.322379,
                  "lng": 118.474458
                },
                "address": "滨河东路汤头段",
                "city": "临沂市",
                "telephone": "(0539)7388999"
              },
              {
                "name": "沂蒙红色影视基地",
                "location": {
                  "lat": 35.680445,
                  "lng": 118.313828
                },
                "address": "临沂市沂南县马牧池乡常山庄村",
                "city": "临沂市",
                "telephone": "(0539)3762666"
              },
              {
                "name": "雪山彩虹谷",
                "location": {
                  "lat": 35.796603,
                  "lng": 118.703337
                },
                "address": "临沂市沂水县沂河山庄东2.5公里",
                "city": "临沂市",
                "telephone": "(0539)2315678"
              },
              {
                "name": "中华银杏园",
                "location": {
                  "lat": 34.627463,
                  "lng": 118.169391
                },
                "address": "徐出口村",
                "city": "临沂市",
                "telephone": "15315490970"
              },
              {
                "name": "天上王城景区",
                "location": {
                  "lat": 35.955852,
                  "lng": 118.366496
                },
                "address": "山东省临沂市沂水县城西北40公里处",
                "city": "临沂市",
                "telephone": "(0539)2698888"
              },
              {
                "name": "山东天马岛旅游区",
                "location": {
                  "lat": 35.330728,
                  "lng": 118.864048
                },
                "address": "临沂市莒南县大店镇陡山",
                "city": "临沂市",
                "telephone": "暂无信息"
              },
              {
                "name": "兰陵国家农业公园",
                "location": {
                  "lat": 34.842249,
                  "lng": 118.036833
                },
                "address": "顺和路",
                "city": "临沂市",
                "telephone": "4001048789,(0539)7928899"
              },
              {
                "name": "红石寨旅游景区",
                "location": {
                  "lat": 35.661886,
                  "lng": 118.423859
                },
                "address": "山东省临沂市沂南县铜井镇",
                "city": "临沂市",
                "telephone": "(0539)3266999"
              },
              {
                "name": "岱崮地貌旅游区",
                "location": {
                  "lat": 35.943453,
                  "lng": 118.151023
                },
                "address": "临沂市蒙阴县岱崮镇",
                "city": "临沂市",
                "telephone": "(0539)4643999"
              },
              {
                "name": "长岛风景区",
                "location": {
                  "lat": 37.98476,
                  "lng": 120.719844
                },
                "address": "山东省烟台市蓬莱区G517",
                "city": "烟台市",
                "telephone": "(0535)3099789"
              },
              {
                "name": "塔山旅游风景区",
                "location": {
                  "lat": 37.516797,
                  "lng": 121.411346
                },
                "address": "烟台市芝罘区塔山路36号",
                "city": "烟台市",
                "telephone": "(0535)6081182,(0535)6082117"
              },
              {
                "name": "养马岛",
                "location": {
                  "lat": 37.471873,
                  "lng": 121.625984
                },
                "address": "烟台市牟平区天马路99号",
                "city": "烟台市",
                "telephone": "(0535)4763763"
              },
              {
                "name": "烟台山景区",
                "location": {
                  "lat": 37.554295,
                  "lng": 121.40866
                },
                "address": "烟台市芝罘区历新路7号",
                "city": "烟台市",
                "telephone": "(0535)6632846,(0535)6632897"
              },
              {
                "name": "欧乐堡梦幻世界",
                "location": {
                  "lat": 37.822929,
                  "lng": 120.797232
                },
                "address": "烟台市蓬莱区海市西路8号",
                "city": "烟台市",
                "telephone": "(0535)5629111,4006398211"
              },
              {
                "name": "烟台金沙滩海滨公园",
                "location": {
                  "lat": 37.579966,
                  "lng": 121.261138
                },
                "address": "海滨路40号",
                "city": "烟台市",
                "telephone": "(0535)6381108"
              },
              {
                "name": "大基山森林公园",
                "location": {
                  "lat": 37.165039,
                  "lng": 120.040892
                },
                "address": "烟台市莱州市颐和路",
                "city": "烟台市",
                "telephone": "(0535)2549787"
              },
              {
                "name": "牟氏庄园",
                "location": {
                  "lat": 37.325438,
                  "lng": 120.84
                },
                "address": "烟台市栖霞市庄园南街6号",
                "city": "烟台市",
                "telephone": "(0535)5228372"
              },
              {
                "name": "招虎山国家森林公园",
                "location": {
                  "lat": 36.866821,
                  "lng": 121.231197
                },
                "address": "海阳市山海路",
                "city": "烟台市",
                "telephone": "暂无信息"
              },
              {
                "name": "罗山黄金文化旅游度假区",
                "location": {
                  "lat": 37.468013,
                  "lng": 120.478804
                },
                "address": "山东省烟台市招远市玲珑镇欧家夼村南",
                "city": "烟台市",
                "telephone": "(0535)8391799"
              },
              {
                "name": "那香海景区",
                "location": {
                  "lat": 37.406635,
                  "lng": 122.421108
                },
                "address": "山东省威海市荣成市环海大道6699号",
                "city": "威海市",
                "telephone": "暂无信息"
              },
              {
                "name": "石岛赤山风景区",
                "location": {
                  "lat": 36.909763,
                  "lng": 122.406431
                },
                "address": "威海市荣成市石岛管理区法华路",
                "city": "威海市",
                "telephone": "(0631)7326666"
              },
              {
                "name": "成山头国家重点风景名胜区",
                "location": {
                  "lat": 37.400042,
                  "lng": 122.710748
                },
                "address": "威海市荣成市成山镇西霞口村",
                "city": "威海市",
                "telephone": "(0631)7834888"
              },
              {
                "name": "银滩滨海旅游度假区",
                "location": {
                  "lat": 36.832812,
                  "lng": 121.703079
                },
                "address": "威海市乳山市长江路868号",
                "city": "威海市",
                "telephone": "(0631)6723231"
              },
              {
                "name": "西霞口旅游度假区",
                "location": {
                  "lat": 37.417409,
                  "lng": 122.638932
                },
                "address": "威海市荣成市海港路(福通天和乐园)",
                "city": "威海市",
                "telephone": "(0631)7834666"
              },
              {
                "name": "大乳山滨海旅游度假区",
                "location": {
                  "lat": 36.781336,
                  "lng": 121.519777
                },
                "address": "山东省威海市乳山市海阳所镇",
                "city": "威海市",
                "telephone": "暂无信息"
              },
              {
                "name": "仙姑顶",
                "location": {
                  "lat": 37.468301,
                  "lng": 122.114167
                },
                "address": "威海市环翠区环山路",
                "city": "威海市",
                "telephone": "(0631)5307799"
              },
              {
                "name": "福如东海文化园",
                "location": {
                  "lat": 36.842162,
                  "lng": 121.729195
                },
                "address": "威海市乳山市长江路863号",
                "city": "威海市",
                "telephone": "(0631)6389999"
              },
              {
                "name": "环翠楼公园",
                "location": {
                  "lat": 37.510627,
                  "lng": 122.114482
                },
                "address": "山东省威海市环翠区公园路与统一路交叉口",
                "city": "威海市",
                "telephone": "(0631)5205877"
              },
              {
                "name": "金宝乐园",
                "location": {
                  "lat": 36.662363,
                  "lng": 119.13143
                },
                "address": "潍坊市奎文区潍洲路2477号",
                "city": "潍坊市",
                "telephone": "(0536)2608171"
              },
              {
                "name": "泰和山风景区",
                "location": {
                  "lat": 36.536423,
                  "lng": 118.2602
                },
                "address": "潍坊市青州市庙子镇",
                "city": "潍坊市",
                "telephone": "暂无信息"
              },
              {
                "name": "九龙峪景区",
                "location": {
                  "lat": 36.5728,
                  "lng": 118.504288
                },
                "address": "山东省潍坊市青州市王坟镇大涧头大桥",
                "city": "潍坊市",
                "telephone": "(0536)3090198"
              },
              {
                "name": "中国·水上王城巨淀湖风景区",
                "location": {
                  "lat": 37.070134,
                  "lng": 118.694025
                },
                "address": "双王城生态经济开发区牛头镇村西900米",
                "city": "潍坊市",
                "telephone": "(0536)5031888"
              },
              {
                "name": "白浪绿洲湿地公园",
                "location": {
                  "lat": 36.656078,
                  "lng": 119.108612
                },
                "address": "山东省潍坊市潍城区机场路与宝通街路口南200米",
                "city": "潍坊市",
                "telephone": "暂无信息"
              },
              {
                "name": "寿光林海生态博览园",
                "location": {
                  "lat": 37.150189,
                  "lng": 118.746851
                },
                "address": "潍坊市寿光市羊口镇寿光林场",
                "city": "潍坊市",
                "telephone": "(0536)5561508"
              },
              {
                "name": "中国杨家埠民间艺术大观园",
                "location": {
                  "lat": 36.764412,
                  "lng": 119.228059
                },
                "address": "潍坊市寒亭区渤海路与富亭街交叉口",
                "city": "潍坊市",
                "telephone": "(0536)2927300,(0536)2927301,(0536)2927303"
              },
              {
                "name": "青云山民俗游乐园",
                "location": {
                  "lat": 36.443863,
                  "lng": 119.254036
                },
                "address": "山东省潍坊市安丘市青云山路东首",
                "city": "潍坊市",
                "telephone": "(0536)4322883"
              },
              {
                "name": "仰天山自然风景区",
                "location": {
                  "lat": 36.458332,
                  "lng": 118.289238
                },
                "address": "山东省潍坊市青州市王坟镇仰天山路",
                "city": "潍坊市",
                "telephone": "(0536)3738399"
              },
              {
                "name": "齐鲁酒地",
                "location": {
                  "lat": 36.534589,
                  "lng": 119.216932
                },
                "address": "山东省潍坊市安丘市新安路79号",
                "city": "潍坊市",
                "telephone": "(0536)8025978"
              },
              {
                "name": "泰山天颐湖旅游度假区",
                "location": {
                  "lat": 36.073733,
                  "lng": 117.117524
                },
                "address": "山东省泰安市岱岳区满庄镇滨湖路",
                "city": "泰安市",
                "telephone": "暂无信息"
              },
              {
                "name": "泰安太阳部落景区",
                "location": {
                  "lat": 36.044413,
                  "lng": 117.122818
                },
                "address": "山东省泰安市岱岳区胜利路天颐湖南",
                "city": "泰安市",
                "telephone": "(0538)5365255"
              },
              {
                "name": "徂徕山国家森林公园",
                "location": {
                  "lat": 36.046745,
                  "lng": 117.243625
                },
                "address": "山东省泰安市岱岳区房村镇大寺前",
                "city": "泰安市",
                "telephone": "(0538)8090017"
              },
              {
                "name": "白佛山风景区",
                "location": {
                  "lat": 35.959031,
                  "lng": 116.441122
                },
                "address": "泰安市东平县东平镇焦村北面",
                "city": "泰安市",
                "telephone": "(0538)3322333"
              },
              {
                "name": "东平湖风景名胜区",
                "location": {
                  "lat": 35.988829,
                  "lng": 116.195869
                },
                "address": "山东省泰安市东平县老湖镇",
                "city": "泰安市",
                "telephone": "暂无信息"
              },
              {
                "name": "泰安方特欢乐世界",
                "location": {
                  "lat": 36.2435,
                  "lng": 117.199165
                },
                "address": "山东省泰安市泰山区明堂路",
                "city": "泰安市",
                "telephone": "暂无信息"
              },
              {
                "name": "新泰新甫山景区",
                "location": {
                  "lat": 36.034031,
                  "lng": 117.695525
                },
                "address": "山东省泰安市新泰市泉沟镇迈莱河路",
                "city": "泰安市",
                "telephone": "(0538)7549166"
              },
              {
                "name": "泰安天乐城水世界",
                "location": {
                  "lat": 36.055637,
                  "lng": 117.090821
                },
                "address": "山东省泰安市岱岳区北留大街7号",
                "city": "泰安市",
                "telephone": "暂无信息"
              },
              {
                "name": "泰山花样年华景区",
                "location": {
                  "lat": 36.183688,
                  "lng": 117.224615
                },
                "address": "泰安市泰山区博阳路中段(泰安农高区)",
                "city": "泰安市",
                "telephone": "(0538)6579999"
              },
              {
                "name": "泰山宝泰隆旅游度假区",
                "location": {
                  "lat": 36.154982,
                  "lng": 117.251825
                },
                "address": "泰安市泰山区崇文路(泰山地下大裂谷景区)",
                "city": "泰安市",
                "telephone": "(0538)6577777"
              },
              {
                "name": "千佛山风景名胜区",
                "location": {
                  "lat": 36.645042,
                  "lng": 117.04269
                },
                "address": "山东省济南市历下区经十一路18号",
                "city": "济南市",
                "telephone": "(0531)82662292,(0531)82662340"
              },
              {
                "name": "九如山度假风景区",
                "location": {
                  "lat": 36.486793,
                  "lng": 117.304238
                },
                "address": "济南市历城区西营街道葫芦峪村",
                "city": "济南市",
                "telephone": "(0531)82826666"
              },
              {
                "name": "红叶谷生态文化旅游区",
                "location": {
                  "lat": 36.490428,
                  "lng": 117.176046
                },
                "address": "济南市历城区锦绣川水库南3公里",
                "city": "济南市",
                "telephone": "(0531)82818666"
              },
              {
                "name": "房干生态旅游区",
                "location": {
                  "lat": 36.437852,
                  "lng": 117.453307
                },
                "address": "山东省济南市莱芜区雪野镇房干村",
                "city": "济南市",
                "telephone": "暂无信息"
              },
              {
                "name": "五龙潭公园",
                "location": {
                  "lat": 36.672317,
                  "lng": 117.021217
                },
                "address": "山东省济南市天桥区筐市街18号",
                "city": "济南市",
                "telephone": "(0531)86921741"
              },
              {
                "name": "灵岩寺旅游区",
                "location": {
                  "lat": 36.371691,
                  "lng": 116.992958
                },
                "address": "济南市长清区万德镇",
                "city": "济南市",
                "telephone": "(0531)87468099"
              },
              {
                "name": "济南国际园博园",
                "location": {
                  "lat": 36.543867,
                  "lng": 116.816749
                },
                "address": "济南市长清区大学路3366号",
                "city": "济南市",
                "telephone": "(0531)87206666"
              },
              {
                "name": "百脉泉公园",
                "location": {
                  "lat": 36.722961,
                  "lng": 117.544756
                },
                "address": "山东省济南市章丘区汇泉路2017号",
                "city": "济南市",
                "telephone": "(0531)83213183"
              },
              {
                "name": "朱家峪旅游度假区",
                "location": {
                  "lat": 36.659318,
                  "lng": 117.586939
                },
                "address": "山东省济南市章丘区官庄镇朱家峪村",
                "city": "济南市",
                "telephone": "(0531)83803186"
              },
              {
                "name": "济南植物园",
                "location": {
                  "lat": 36.627358,
                  "lng": 117.467764
                },
                "address": "山东省济南市章丘区243省道附近",
                "city": "济南市",
                "telephone": "(0531)80950818"
              },
              {
                "name": "孙子文化旅游区",
                "location": {
                  "lat": 37.052087,
                  "lng": 118.463532
                },
                "address": "山东省东营市广饶县乐安大街1678号",
                "city": "东营市",
                "telephone": "(0546)6095555"
              },
              {
                "name": "揽翠湖度假区",
                "location": {
                  "lat": 37.417974,
                  "lng": 118.595591
                },
                "address": "东营市东营区南二路",
                "city": "东营市",
                "telephone": "暂无信息"
              },
              {
                "name": "天宁寺",
                "location": {
                  "lat": 37.578168,
                  "lng": 118.429613
                },
                "address": "东营市垦利区胜坨镇政府以北",
                "city": "东营市",
                "telephone": "13305461414"
              },
              {
                "name": "龙居黄河森林旅游区",
                "location": {
                  "lat": 37.41201,
                  "lng": 118.27838
                },
                "address": "东营市东营区008乡道",
                "city": "东营市",
                "telephone": "暂无信息"
              },
              {
                "name": "刘集红色旅游区",
                "location": {
                  "lat": 36.973596,
                  "lng": 118.530155
                },
                "address": "山东省东营市广饶县大王镇刘集后村",
                "city": "东营市",
                "telephone": "(0546)6852555"
              },
              {
                "name": "孤岛槐树林温泉旅游区",
                "location": {
                  "lat": 37.911282,
                  "lng": 118.831102
                },
                "address": "山东省东营市河口区孤岛镇",
                "city": "东营市",
                "telephone": "暂无信息"
              },
              {
                "name": "微山湖旅游区",
                "location": {
                  "lat": 34.689652,
                  "lng": 117.28291
                },
                "address": "济宁市微山县X018",
                "city": "济宁市",
                "telephone": "0537-8550005"
              },
              {
                "name": "水泊梁山风景名胜区",
                "location": {
                  "lat": 35.794162,
                  "lng": 116.111562
                },
                "address": "济宁市梁山县越山南路36号",
                "city": "济宁市",
                "telephone": "(0537)7329017"
              },
              {
                "name": "峄山风景名胜区",
                "location": {
                  "lat": 35.334727,
                  "lng": 117.041445
                },
                "address": "山东省济宁邹城市峄山镇",
                "city": "济宁市",
                "telephone": "(0537)5670091,(0537)5670498"
              },
              {
                "name": "羊山古镇国际军事旅游度假区",
                "location": {
                  "lat": 35.182159,
                  "lng": 116.24477
                },
                "address": "山东省济宁市金乡县羊山镇",
                "city": "济宁市",
                "telephone": "(0537)8911001"
              },
              {
                "name": "微山湖南阳古镇",
                "location": {
                  "lat": 35.098392,
                  "lng": 116.680262
                },
                "address": "山东省济宁市微山县南阳镇顺和村",
                "city": "济宁市",
                "telephone": "(0537)8122866"
              },
              {
                "name": "莲花湖湿地",
                "location": {
                  "lat": 35.77027,
                  "lng": 116.52554
                },
                "address": "济宁市汶上县城北沿滨湖大道2公里处",
                "city": "济宁市",
                "telephone": "(0537)7829996"
              },
              {
                "name": "万紫千红生态养生旅游区",
                "location": {
                  "lat": 35.499197,
                  "lng": 117.416559
                },
                "address": "山东省济宁市泗水县泗张镇张丰公路",
                "city": "济宁市",
                "telephone": "(0537)5091888"
              },
              {
                "name": "孔子六艺城",
                "location": {
                  "lat": 35.587568,
                  "lng": 117.003055
                },
                "address": "济宁市曲阜市春秋路33号",
                "city": "济宁市",
                "telephone": "(0537)4497648,(0537)4494810"
              },
              {
                "name": "兖州兴隆文化园",
                "location": {
                  "lat": 35.56762,
                  "lng": 116.841687
                },
                "address": "酒仙桥北路10号",
                "city": "济宁市",
                "telephone": "(0537)3879203,18266860018"
              },
              {
                "name": "微山湖旅游区-微山岛",
                "location": {
                  "lat": 34.66097,
                  "lng": 117.245648
                },
                "address": "济宁市微山县微山岛镇104国道",
                "city": "济宁市",
                "telephone": "暂无信息"
              },
              {
                "name": "栈桥",
                "location": {
                  "lat": 36.065436,
                  "lng": 120.32659
                },
                "address": "青岛市市南区太平路12号",
                "city": "青岛市",
                "telephone": "(0532)82884548"
              },
              {
                "name": "金沙滩",
                "location": {
                  "lat": 35.969627,
                  "lng": 120.259238
                },
                "address": "青岛市西海岸新区金沙滩路",
                "city": "青岛市",
                "telephone": "(0532)86707399"
              },
              {
                "name": "琅琊台风景名胜区",
                "location": {
                  "lat": 35.655121,
                  "lng": 119.914044
                },
                "address": "青岛西海岸新区",
                "city": "青岛市",
                "telephone": "(0532)87111111"
              },
              {
                "name": "海滨风景区",
                "location": {
                  "lat": 36.06795,
                  "lng": 120.390156
                },
                "address": "青岛市市南区京山路11号",
                "city": "青岛市",
                "telephone": "(0532)82872937"
              },
              {
                "name": "石老人观光园",
                "location": {
                  "lat": 36.103667,
                  "lng": 120.514338
                },
                "address": "青岛市崂山区崂山路1号",
                "city": "青岛市",
                "telephone": "(0532)88890758"
              },
              {
                "name": "大珠山风景区",
                "location": {
                  "lat": 35.792369,
                  "lng": 119.991052
                },
                "address": "青岛市黄岛区山川路1117号",
                "city": "青岛市",
                "telephone": "(0532)84123456,(0532)85131271"
              },
              {
                "name": "青岛奥林匹克雕塑文化园",
                "location": {
                  "lat": 36.291942,
                  "lng": 120.401812
                },
                "address": "山东省青岛市城阳区兴阳路318号",
                "city": "青岛市",
                "telephone": "(0532)87759871"
              },
              {
                "name": "城市阳台景区",
                "location": {
                  "lat": 35.87923,
                  "lng": 120.062238
                },
                "address": "黄岛区滨海大道1288号",
                "city": "青岛市",
                "telephone": "暂无信息"
              },
              {
                "name": "青岛方特梦幻王国",
                "location": {
                  "lat": 36.214821,
                  "lng": 120.289306
                },
                "address": "青岛市城阳区红岛街道岙东南路华强文化产业基地内",
                "city": "青岛市",
                "telephone": "(0532)58759642"
              },
              {
                "name": "茶山",
                "location": {
                  "lat": 36.937566,
                  "lng": 119.993428
                },
                "address": "青岛市平度市店子镇",
                "city": "青岛市",
                "telephone": "(0532)85329866"
              },
              {
                "name": "抱犊崮国家森林公园",
                "location": {
                  "lat": 34.996663,
                  "lng": 117.725876
                },
                "address": "枣庄市山亭区北庄镇",
                "city": "枣庄市",
                "telephone": "(0632)8990190,(0632)8915199"
              },
              {
                "name": "滕州微山湖红荷湿地景区",
                "location": {
                  "lat": 35.130872,
                  "lng": 116.856109
                },
                "address": "山东省枣庄市滕州市滨湖镇湖东大堤路",
                "city": "枣庄市",
                "telephone": "(0632)5816666"
              },
              {
                "name": "翼云石头部落",
                "location": {
                  "lat": 35.116543,
                  "lng": 117.507414
                },
                "address": "山城街道兴隆庄村",
                "city": "枣庄市",
                "telephone": "(0632)8809026,(0632)8809888"
              },
              {
                "name": "枣庄熊耳山国家地质公园",
                "location": {
                  "lat": 35.011501,
                  "lng": 117.638157
                },
                "address": "枣庄市山亭区北庄镇",
                "city": "枣庄市",
                "telephone": "(0632)8912939"
              },
              {
                "name": "冠世榴园风景区",
                "location": {
                  "lat": 34.778429,
                  "lng": 117.55242
                },
                "address": "枣庄市峄城区榴园路",
                "city": "枣庄市",
                "telephone": "(0632)5760789"
              },
              {
                "name": "台儿庄运河国家湿地景区",
                "location": {
                  "lat": 34.559937,
                  "lng": 117.723214
                },
                "address": "枣庄市台儿庄区运河北岸路",
                "city": "枣庄市",
                "telephone": "暂无信息"
              },
              {
                "name": "枣庄老街",
                "location": {
                  "lat": 34.851937,
                  "lng": 117.540832
                },
                "address": "山东省枣庄市市中区龙头西路与西昌中路交叉路口西侧",
                "city": "枣庄市",
                "telephone": "暂无信息"
              },
              {
                "name": "台儿庄大战纪念馆",
                "location": {
                  "lat": 34.563772,
                  "lng": 117.737888
                },
                "address": "山东省枣庄市台儿庄区古运路6号",
                "city": "枣庄市",
                "telephone": "(0632)6612711"
              },
              {
                "name": "鲁南水城",
                "location": {
                  "lat": 34.853486,
                  "lng": 117.539517
                },
                "address": "枣庄市市中区西昌中路1号",
                "city": "枣庄市",
                "telephone": "暂无信息"
              },
              {
                "name": "汉诺庄园",
                "location": {
                  "lat": 35.098558,
                  "lng": 117.47937
                },
                "address": "汉诺路6号",
                "city": "枣庄市",
                "telephone": "(0632)8869111"
              },
              {
                "name": "原山国家森林公园",
                "location": {
                  "lat": 36.486713,
                  "lng": 117.841689
                },
                "address": "淄博市博山区颜山公园路4号",
                "city": "淄博市",
                "telephone": "(0533)4187724"
              },
              {
                "name": "鲁山国家森林公园",
                "location": {
                  "lat": 36.315514,
                  "lng": 118.055055
                },
                "address": "淄博市博山区池上镇",
                "city": "淄博市",
                "telephone": "(0533)4860002"
              },
              {
                "name": "淄博聊斋旅游区",
                "location": {
                  "lat": 36.634405,
                  "lng": 118.022594
                },
                "address": "山东省淄博市淄川区洪山镇蒲家村",
                "city": "淄博市",
                "telephone": "(0533)5826666,(0533)5819258"
              },
              {
                "name": "潭溪山旅游区",
                "location": {
                  "lat": 36.499156,
                  "lng": 118.2061
                },
                "address": "山东省淄博市淄川区太河镇峨庄乡石沟村",
                "city": "淄博市",
                "telephone": "(0533)5036666"
              },
              {
                "name": "周村古商城",
                "location": {
                  "lat": 36.80462,
                  "lng": 117.84852
                },
                "address": "淄博市周村区新建中路1号",
                "city": "淄博市",
                "telephone": "(0533)6450097"
              },
              {
                "name": "沂源鲁山溶洞群风景区",
                "location": {
                  "lat": 36.280952,
                  "lng": 118.074528
                },
                "address": "淄博市沂源县南鲁山镇望峰路",
                "city": "淄博市",
                "telephone": "(0533)3680898"
              },
              {
                "name": "开元溶洞",
                "location": {
                  "lat": 36.415605,
                  "lng": 118.04639
                },
                "address": "淄博市博山区源泉镇东高村",
                "city": "淄博市",
                "telephone": "(0533)4814066,(0533)4814200"
              },
              {
                "name": "齐山风景区",
                "location": {
                  "lat": 36.523409,
                  "lng": 118.195935
                },
                "address": "山东省淄博市淄川区太河镇镇政府南5公里",
                "city": "淄博市",
                "telephone": "(0533)5087733"
              },
              {
                "name": "牛郎织女景区",
                "location": {
                  "lat": 36.101702,
                  "lng": 118.256339
                },
                "address": "淄博市沂源县燕崖镇牛郎村",
                "city": "淄博市",
                "telephone": "(0533)3440137"
              },
              {
                "name": "淄博市王渔洋故里景区",
                "location": {
                  "lat": 36.956384,
                  "lng": 117.94717
                },
                "address": "新城镇新立村王士禛纪念馆",
                "city": "淄博市",
                "telephone": "暂无信息"
              },
              {
                "name": "房干生态旅游区",
                "location": {
                  "lat": 36.437852,
                  "lng": 117.453307
                },
                "address": "山东省济南市莱芜区雪野镇房干村",
                "city": "济南市",
                "telephone": "暂无信息"
              },
              {
                "name": "莱芜战役纪念馆",
                "location": {
                  "lat": 36.223059,
                  "lng": 117.69914
                },
                "address": "山东省济南市莱芜区汶阳大街43号",
                "city": "济南市",
                "telephone": "(0531)78805690"
              },
              {
                "name": "万平口海滨风景区",
                "location": {
                  "lat": 35.412151,
                  "lng": 119.570967
                },
                "address": "日照市东港区海曲东路398号",
                "city": "日照市",
                "telephone": "(0633)7911888,(0633)8899611"
              },
              {
                "name": "日照海滨国家森林公园",
                "location": {
                  "lat": 35.546006,
                  "lng": 119.631977
                },
                "address": "山东省日照市东港区碧海路北首",
                "city": "日照市",
                "telephone": "(0633)3680998"
              },
              {
                "name": "五莲山旅游风景区",
                "location": {
                  "lat": 35.69219,
                  "lng": 119.408463
                },
                "address": "山东省日照市五莲县兰陵路1号",
                "city": "日照市",
                "telephone": "(0633)5231708"
              },
              {
                "name": "浮来山景区",
                "location": {
                  "lat": 35.601878,
                  "lng": 118.743577
                },
                "address": "日照市莒县浮来山街道浮来西路1001号",
                "city": "日照市",
                "telephone": "(0633)6269977"
              },
              {
                "name": "大青山风景区",
                "location": {
                  "lat": 35.670254,
                  "lng": 119.202114
                },
                "address": "山东省日照市五莲县222省道西",
                "city": "日照市",
                "telephone": "15863399555"
              },
              {
                "name": "刘家湾赶海园",
                "location": {
                  "lat": 35.288437,
                  "lng": 119.434321
                },
                "address": "日照市东港区涛雒镇沿海公路中段",
                "city": "日照市",
                "telephone": "(0633)2957006"
              },
              {
                "name": "龙门崮风景区",
                "location": {
                  "lat": 35.554072,
                  "lng": 119.133651
                },
                "address": "日照市东港区三庄镇",
                "city": "日照市",
                "telephone": "(0633)8822222"
              },
              {
                "name": "曹州牡丹园",
                "location": {
                  "lat": 35.285893,
                  "lng": 115.504041
                },
                "address": "菏泽市牡丹区人民路1000号",
                "city": "菏泽市",
                "telephone": "(0530)5640188"
              },
              {
                "name": "浮龙湖生态旅游区",
                "location": {
                  "lat": 34.638641,
                  "lng": 115.971123
                },
                "address": "山东省菏泽市单县浮岗镇",
                "city": "菏泽市",
                "telephone": "(0530)4611766"
              },
              {
                "name": "水浒好汉城",
                "location": {
                  "lat": 35.591326,
                  "lng": 115.938353
                },
                "address": "菏泽市郓城县西门街南段",
                "city": "菏泽市",
                "telephone": "(0530)6896888"
              },
              {
                "name": "孙膑旅游城",
                "location": {
                  "lat": 35.648748,
                  "lng": 115.727418
                },
                "address": "山东省菏泽市鄄城县箕山镇孙花园村北",
                "city": "菏泽市",
                "telephone": "暂无信息"
              },
              {
                "name": "亿城寺",
                "location": {
                  "lat": 35.649006,
                  "lng": 115.730474
                },
                "address": "箕山镇孙花园村北",
                "city": "菏泽市",
                "telephone": "暂无信息"
              },
              {
                "name": "阳谷景阳冈旅游区",
                "location": {
                  "lat": 36.093464,
                  "lng": 115.989415
                },
                "address": "聊城市阳谷县张秋镇021县道附近",
                "city": "聊城市",
                "telephone": "(0635)6361567"
              },
              {
                "name": "东昌湖",
                "location": {
                  "lat": 36.448439,
                  "lng": 115.975486
                },
                "address": "山东省聊城市东昌府区湖滨路2号",
                "city": "聊城市",
                "telephone": "(0635)8192222"
              },
              {
                "name": "东阿药王山",
                "location": {
                  "lat": 36.351486,
                  "lng": 116.249317
                },
                "address": "聊城市东阿县环球路",
                "city": "聊城市",
                "telephone": "(0635)7105890"
              },
              {
                "name": "东阿阿胶城",
                "location": {
                  "lat": 36.352178,
                  "lng": 116.246304
                },
                "address": "山东省聊城市东阿县环球路",
                "city": "聊城市",
                "telephone": "暂无信息"
              },
              {
                "name": "狮子楼",
                "location": {
                  "lat": 36.118411,
                  "lng": 115.788095
                },
                "address": "阳谷县紫荆街1号",
                "city": "聊城市",
                "telephone": "(0635)6363199"
              },
              {
                "name": "山陕会馆",
                "location": {
                  "lat": 36.444443,
                  "lng": 115.987061
                },
                "address": "聊城市东昌府区大码头街",
                "city": "聊城市",
                "telephone": "(0635)8246101"
              },
              {
                "name": "中国阿胶博物馆",
                "location": {
                  "lat": 36.34804,
                  "lng": 116.269289
                },
                "address": "山东省聊城市东阿县阿胶街78号",
                "city": "聊城市",
                "telephone": "(0635)3261380"
              },
              {
                "name": "鹤伴山",
                "location": {
                  "lat": 36.776476,
                  "lng": 117.725639
                },
                "address": "山东省滨州市邹平市西董街道",
                "city": "滨州市",
                "telephone": "(0543)4557038"
              },
              {
                "name": "魏集古村落",
                "location": {
                  "lat": 37.305411,
                  "lng": 117.766994
                },
                "address": "魏集镇桑王路与同韩路路口往东230米",
                "city": "滨州市",
                "telephone": "(0543)2133666"
              },
              {
                "name": "无棣古城旅游景区",
                "location": {
                  "lat": 37.745583,
                  "lng": 117.608879
                },
                "address": "山东省滨州市无棣县棣新一路",
                "city": "滨州市",
                "telephone": "(0543)6331088"
              },
              {
                "name": "孙武古城旅游区",
                "location": {
                  "lat": 37.489754,
                  "lng": 117.517954
                },
                "address": "滨州市惠民县故园南路",
                "city": "滨州市",
                "telephone": "暂无信息"
              },
              {
                "name": "杜受田故居",
                "location": {
                  "lat": 37.486144,
                  "lng": 117.974271
                },
                "address": "山东省滨州市滨城区滨北街道办事处南街",
                "city": "滨州市",
                "telephone": "(0543)3561688"
              },
              {
                "name": "秦皇河公园",
                "location": {
                  "lat": 37.351908,
                  "lng": 117.951167
                },
                "address": "山东省滨州市滨城区渤海十九路",
                "city": "滨州市",
                "telephone": "暂无信息"
              },
              {
                "name": "博兴县打渔张森林公园",
                "location": {
                  "lat": 37.367047,
                  "lng": 118.170712
                },
                "address": "滨州市博兴县乔庄镇(近黄河南岸)",
                "city": "滨州市",
                "telephone": "暂无信息"
              }
        ]
    }
	response.send(a)
})

app.listen(5003,(err)=>{
	if(!err) console.log('服务器3启动成功了,请求学生信息地址为：http://localhost:5003/api/students');
})